{
  "गेहूं": {
    "sowing_time": "अक्टूबर के अंत से नवंबर तक",
    "general_info": "गेहूं भारत की एक प्रमुख रबी फसल है, जो मुख्यतः रोटी और अन्य खाद्य पदार्थों के लिए उगाई जाती है।",
    "pests": ["दीमक", "माहू (एफिड)", "गुलाबी सुंडी"],
    "fertilizers": "बुवाई के समय: 50 किलो डीएपी और 20 किलो म्यूरेट ऑफ पोटाश प्रति एकड़। पहली सिंचाई (बुवाई के 20-25 दिन बाद): 40-50 किलो यूरिया प्रति एकड़। आवश्यकतानुसार दूसरी यूरिया की टॉपड्रेसिंग बाली निकलने से पहले।",
    "soil_type": "अच्छे जल निकास वाली दोमट या बलुई दोमट मिट्टी सर्वोत्तम होती है, जिसका पीएच मान 6.0 से 7.5 के बीच हो।",
    "irrigation": "आमतौर पर 4-6 सिंचाई की आवश्यकता होती है। क्राउन रूट इनिशिएशन (CRI), शीर्ष ड्रेसिंग, फूल आने और दाना भरने की अवस्थाएं सिंचाई के लिए महत्वपूर्ण हैं।"
  },
  "धान": {
    "sowing_time": "जून से जुलाई (खरीफ धान के लिए सीधी बुवाई या रोपाई)",
    "general_info": "धान (चावल) भारत की मुख्य खाद्य फसल है और खरीफ मौसम की प्रमुख फसल है।",
    "pests": ["तना छेदक (स्टेम बोरर)", "पत्ती लपेटक (लीफ फोल्डर)", "भूरा फुदका (ब्राउन प्लांट हॉपर)"],
    "fertilizers": "रोपाई के समय: 25-30 किलो डीएपी, 20 किलो म्यूरेट ऑफ पोटाश, और 10 किलो जिंक सल्फेट प्रति एकड़। कल्ले फूटते समय (20-25 दिन बाद) और बाली आने से लगभग 20 दिन पहले यूरिया की टॉपड्रेसिंग करें।",
    "soil_type": "भारी मिट्टी जिसमें जल धारण क्षमता अच्छी हो, जैसे चिकनी, चिकनी दोमट या दोमट मिट्टी। पीएच मान 5.5 से 7.0 के बीच उपयुक्त होता है।",
    "irrigation": "खेत में लगातार 2-5 सेमी पानी खड़ा रहना चाहिए, खासकर रोपाई से लेकर बाली में दाना भरने तक। कटाई से 10-15 दिन पहले पानी निकाल दें।"
  },
  "सरसों": {
    "sowing_time": "सितंबर के अंत से अक्टूबर के मध्य तक",
    "general_info": "सरसों भारत की एक महत्वपूर्ण तिलहनी फसल है, जो रबी मौसम में उगाई जाती है।",
    "pests": ["माहू (एफिड)", "आरा मक्खी (सॉफ्लाई)", "पत्ती सुरंगक (लीफ माइनर)"],
    "fertilizers": "बुवाई के समय: 20-25 किलो नाइट्रोजन (लगभग 50 किलो यूरिया), 60-80 किलो फास्फोरस (एसएसपी या डीएपी से), 40 किलो पोटाश प्रति हेक्टेयर। पहली सिंचाई (बुवाई के 30-35 दिन बाद) पर 20-25 किलो नाइट्रोजन की टॉपड्रेसिंग।",
    "soil_type": "अच्छी जल निकासी वाली बलुई दोमट से दोमट मिट्टी। हल्की क्षारीयता सहन कर सकती है।",
    "irrigation": "आमतौर पर 1-2 सिंचाई पर्याप्त होती हैं। पहली सिंचाई बुवाई के 30-35 दिन बाद (शाखाएँ निकलते समय) और दूसरी फली बनने की अवस्था में यदि नमी की कमी हो।"
  },
  "चना": {
    "sowing_time": "अक्टूबर के मध्य से नवंबर के पहले सप्ताह तक",
    "general_info": "चना एक प्रमुख दलहनी फसल है जो रबी मौसम में उगाई जाती है और मिट्टी की उर्वरता बढ़ाने में सहायक है।",
    "pests": ["फली छेदक (पॉड बोरर)", "उकठा रोग (विल्ट)", "दीमक"],
    "fertilizers": "दलहनी फसल होने के कारण इसे कम नाइट्रोजन की आवश्यकता होती है। बुवाई के समय 20 किलो नाइट्रोजन, 50-60 किलो फास्फोरस (डीएपी या एसएसपी से), और 20 किलो पोटाश प्रति हेक्टेयर। राइजोबियम कल्चर से बीज उपचार लाभकारी होता है।",
    "soil_type": "अच्छी जल निकासी वाली, मध्यम से भारी दोमट मिट्टी। पीएच मान 6.0 से 7.5 उपयुक्त होता है।",
    "irrigation": "आमतौर पर वर्षा आधारित फसल के रूप में उगाया जाता है। यदि आवश्यक हो तो फूल आने से पहले या फली बनने की अवस्था में एक हल्की सिंचाई की जा सकती है। अत्यधिक सिंचाई से उकठा रोग का प्रकोप बढ़ सकता है।"
  },
  "मक्का": {
    "sowing_time": "खरीफ: जून से जुलाई; रबी (कुछ क्षेत्रों में): अक्टूबर से नवंबर; जायद/बसंत: फरवरी से मार्च",
    "general_info": "मक्का एक बहुउपयोगी फसल है जो अनाज, चारा, और औद्योगिक कच्चे माल के रूप में उपयोग होती है।",
    "pests": ["तना मक्खी (स्टेम फ्लाई)", "फॉल आर्मीवर्म", "दीमक", "सफेद लट (व्हाइट ग्रब)"],
    "fertilizers": "सामान्य सिफारिश: 100-120 किलो नाइट्रोजन, 50-60 किलो फास्फोरस, और 40-50 किलो पोटाश प्रति हेक्टेयर। नाइट्रोजन की 1/3 मात्रा, पूरी फास्फोरस और पोटाश बुवाई के समय दें। शेष नाइट्रोजन को दो भागों में - जब पौधा घुटने तक ऊँचा हो (लगभग 30 दिन) और दूसरा नर फूल आने (टैसलिंग) से पहले।",
    "soil_type": "अच्छी जल निकासी वाली, गहरी, उपजाऊ दोमट मिट्टी जिसमें जैविक पदार्थ प्रचुर मात्रा में हों। पीएच मान 6.5 से 7.5 सर्वोत्तम है।",
    "irrigation": "फसल की अवस्था, मिट्टी के प्रकार और मौसम के आधार पर 4-6 सिंचाई। नर फूल आने (टैसलिंग), मादा फूल आने (सिल्किंग) और दाना भरने की अवस्था सिंचाई के लिए बहुत महत्वपूर्ण हैं।"
  },
  "आलू": {
    "sowing_time": "मैदानी क्षेत्रों में: अक्टूबर का दूसरा पखवाड़ा से नवंबर का पहला पखवाड़ा। पहाड़ी क्षेत्रों में: फरवरी से अप्रैल।",
    "general_info": "आलू दुनिया की सबसे महत्वपूर्ण सब्जी फसलों में से एक है और यह स्टार्च का अच्छा स्रोत है।",
    "pests": ["अगेती झुलसा (अर्ली ब्लाइट)", "पछेती झुलसा (लेट ब्लाइट)", "आलू का कंद शलभ (पोटैटो ट्यूबर मॉथ)", "माहू (एफिड)"],
    "fertilizers": "रोपण के समय: 100-120 किलो नाइट्रोजन, 80-100 किलो फास्फोरस, और 80-100 किलो पोटाश प्रति हेक्टेयर। नाइट्रोजन की आधी मात्रा रोपण के समय और शेष आधी मिट्टी चढ़ाते समय (रोपण के 25-30 दिन बाद)।",
    "soil_type": "अच्छी जल निकासी वाली, भुरभुरी, जैविक पदार्थ युक्त बलुई दोमट या दोमट मिट्टी। पीएच मान 5.5 से 6.5।",
    "irrigation": "रोपण के तुरंत बाद हल्की सिंचाई। इसके बाद 7-10 दिन के अंतराल पर सिंचाई, कंद बनते समय नमी की कमी नहीं होनी चाहिए। खुदाई से 10-15 दिन पहले सिंचाई बंद कर दें।"
  },
  "टमाटर": {
    "sowing_time": "उत्तरी मैदानी क्षेत्रों में: जुलाई (खरीफ), नवंबर (रबी), फरवरी (जायद)। पहाड़ी क्षेत्रों में: मार्च-अप्रैल।",
    "general_info": "टमाटर एक लोकप्रिय सब्जी है और विटामिन ए और सी का अच्छा स्रोत है।",
    "pests": ["फल छेदक (फ्रूट बोरर)", "अगेती झुलसा (अर्ली ब्लाइट)", "पछेती झुलसा (लेट ब्लाइट)", "लीफ कर्ल वायरस (सफेद मक्खी द्वारा फैलता है)"],
    "fertilizers": "रोपाई के समय: 60-80 किलो नाइट्रोजन, 80-100 किलो फास्फोरस, 60-80 किलो पोटाश प्रति हेक्टेयर। नाइट्रोजन की शेष मात्रा (60-80 किलो) को 2-3 भागों में रोपाई के 20-25 दिन बाद देना चाहिए।",
    "soil_type": "अच्छी जल निकासी वाली, जैविक पदार्थ से भरपूर, बलुई दोमट से लेकर चिकनी दोमट मिट्टी। पीएच मान 6.0 से 7.0।",
    "irrigation": "मौसम और मिट्टी के प्रकार के आधार पर 7-10 दिन के अंतराल पर सिंचाई। फूल आने और फल लगने की अवस्था में नियमित सिंचाई महत्वपूर्ण है।"
  },
  "प्याज": {
    "sowing_time": "रबी फसल के लिए नर्सरी में बीज की बुवाई अक्टूबर-नवंबर में, रोपाई दिसंबर-जनवरी में। खरीफ फसल के लिए नर्सरी जून-जुलाई में, रोपाई अगस्त-सितंबर में।",
    "general_info": "प्याज एक महत्वपूर्ण मसाले वाली सब्जी फसल है जो लगभग पूरे भारत में उगाई जाती है।",
    "pests": ["थ्रिप्स", "बैंगनी धब्बा (पर्पल ब्लॉच)", "स्टेमफिलियम ब्लाइट", "प्याज की मक्खी (अनियन मैगॉट)"],
    "fertilizers": "रोपाई के समय: 50 किलो नाइट्रोजन, 50 किलो फास्फोरस, और 100 किलो पोटाश प्रति हेक्टेयर। रोपाई के 30 और 45-60 दिन बाद 25-25 किलो नाइट्रोजन की टॉपड्रेसिंग।",
    "soil_type": "अच्छी जल निकासी वाली, भुरभुरी, जैविक पदार्थ युक्त दोमट या बलुई दोमट मिट्टी। पीएच मान 6.0 से 7.5।",
    "irrigation": "रोपाई के तुरंत बाद हल्की सिंचाई। इसके बाद 7-12 दिन के अंतराल पर आवश्यकतानुसार सिंचाई। कंद बनते समय पर्याप्त नमी आवश्यक है। खुदाई से 15 दिन पहले सिंचाई बंद कर दें।"
  },
  "अरहर": {
    "sowing_time": "जून से जुलाई (खरीफ)",
    "general_info": "अरहर एक महत्वपूर्ण दलहनी फसल है जो प्रोटीन का अच्छा स्रोत है। यह मिट्टी की उर्वरता भी बढाती है।",
    "pests": ["फली छेदक", "माहू", "पत्ती मोड़क इल्ली"],
    "fertilizers": "बुवाई के समय 20 किलो नाइट्रोजन और 50-60 किलो फास्फोरस प्रति हेक्टेयर। राइजोबियम कल्चर से बीज उपचार अवश्य करें।",
    "soil_type": "अच्छी जल निकासी वाली दोमट या बलुई दोमट मिट्टी। पीएच मान 6.5 से 7.5।",
    "irrigation": "आमतौर पर वर्षा आधारित। फूल आने और फली बनने के समय नमी की कमी होने पर एक या दो सिंचाई लाभकारी होती है।"
  }
}