[
  {
    "name": "मुख्यमंत्री मैनिया सम्मान योजना (झारखंड)",
    "keywords": [
      "मैनिया सम्मान योजना", 
      "मुख्यमंत्री मैनिया सम्मान", 
      "महिलाओं के लिए योजना झारखंड",
      "मैया योजना",            
      "मैया सम्मान",           
      "मुख्यमंत्री मैया योजना", 
      "मैनिया योजना"          
    ],
    "category": "Jharkhand Scheme",
    "focus": "महिलाओं को वित्तीय सहायता",
    "details": "अगस्त 2024 में शुरू की गई यह योजना 21 से 50 वर्ष की आयु की महिलाओं को वित्तीय सहायता प्रदान करती है। दिसंबर 2024 से यह सहायता डायरेक्ट बेनिफिट ट्रांसफर (डीबीटी) के माध्यम से प्रति माह ₹2,500 कर दी गई है।",
    "eligibility": "झारखंड में 21 से 50 वर्ष की आयु की महिलाएं।",
    "advice": "पात्र महिलाओं को यह सुनिश्चित करने की सलाह दी जाती है कि उनके बैंक खाते सक्रिय हों और डीबीटी के लिए जुड़े हों। यह ग्रामीण परिवारों को महत्वपूर्ण वित्तीय सहायता प्रदान करती है।"
  },
  {
    "name": "नाबार्ड का झारखंड के लिए वित्तीय फोकस (NABARD Jharkhand Focus)",
    "keywords": ["नाबार्ड झारखंड", "NABARD Jharkhand", "झारखंड विकास योजना", "ग्रामीण विकास नाबार्ड"],
    "category": "Jharkhand Initiative",
    "focus": "ग्रामीण और कृषि विकास के लिए वित्तीय आवंटन",
    "details": "राष्ट्रीय कृषि और ग्रामीण विकास बैंक (नाबार्ड) ने 2024-25 वित्तीय वर्ष के लिए झारखंड में विभिन्न विकासात्मक योजनाओं के लिए ₹5,830 करोड़ आवंटित किए। यह आदिवासी कल्याण (जैसे बागवानी, लाख की खेती), कृषि विकास (दो मेगा लिफ्ट-सिंचाई परियोजनाएं), ग्रामीण बुनियादी ढांचे (गोदाम, पुल, पेयजल), ग्रामीण ऋण को मजबूत करने और वाटरशेड विकास पर केंद्रित है। 2025-2026 के लिए, नाबार्ड का लक्ष्य जलवायु-लचीला कृषि, डिजिटल नवाचार, ग्रामीण उद्यमिता, और लाख और टसर जैसे क्षेत्रों में मूल्य श्रृंखलाओं को और मजबूत करना है।",
    "eligibility": "किसान, ग्रामीण उद्यमी, FPOs, बैंक (विशिष्ट उप-योजनाओं के आधार पर)।",
    "advice": "इन फोकस क्षेत्रों के तहत विशिष्ट कार्यक्रमों और सहायता के लिए देखें। उप-योजनाओं पर विवरण के लिए नाबार्ड या संबंधित बैंकों से संपर्क करें।"
  },
  {
    "name": "किसान समृद्धि योजना (झारखंड)",
    "keywords": ["किसान समृद्धि योजना झारखंड", "सौर सिंचाई सब्सिडी", "सोलर पंप झारखंड", "90% सब्सिडी सिंचाई"],
    "category": "Jharkhand Scheme",
    "focus": "सौर सिंचाई के लिए सब्सिडी",
    "details": "यह योजना सौर ऊर्जा चालित सिंचाई इकाइयों (स्थिर और पोर्टेबल दोनों) के लिए किसानों को 90% तक की सब्सिडी प्रदान करके सिंचाई के लिए सौर ऊर्जा के उपयोग को बढ़ावा देती है।",
    "eligibility": "झारखंड के किसान।",
    "advice": "जीवाश्म ईंधन पर निर्भरता कम करने और कृषि लागत कम करने में मदद करता है। पात्रता और आवेदन प्रक्रियाओं के बारे में संबंधित राज्य कृषि विभागों या सामान्य सेवा केंद्रों (CSCs) के माध्यम से पूछताछ करें।"
  },
  {
    "name": "कृषि सलाहकार सेवाएं (झारखंड)",
    "keywords": ["कृषि सलाह झारखंड", "मौसम सलाह झारखंड", "एग्रो एडवाइजरी झारखंड", "बिरसा कृषि विश्वविद्यालय सलाह"],
    "category": "Jharkhand Advisory",
    "focus": "मौसम और फसल-विशिष्ट सलाह",
    "details": "आईएमडी रांची, बिरसा कृषि विश्वविद्यालय और राज्य कृषि विभाग के सहयोग से, झारखंड के सभी 263 ब्लॉकों के लिए द्वि-साप्ताहिक कृषि सलाहकार सेवा बुलेटिन प्रदान करता है। इसमें मौसम का पूर्वानुमान और मौसम के प्रति संवेदनशील गतिविधियों के लिए सलाह शामिल है।",
    "eligibility": "झारखंड के सभी किसान।",
    "advice": "बुवाई, सिंचाई, कीट प्रबंधन और कटाई के बारे में सूचित निर्णय लेने के लिए इन ब्लॉक-स्तरीय सलाहों का उपयोग करें।"
  },
  {
    "name": "प्रधानमंत्री किसान सम्मान निधि (PM-KISAN)",
    "keywords": ["पीएम किसान", "PM KISAN", "किसान सम्मान निधि", "6000 रुपये योजना"],
    "category": "All India Scheme",
    "focus": "प्रत्यक्ष आय सहायता",
    "details": "पात्र किसानों के बैंक खातों में सीधे तीन किश्तों में प्रति वर्ष ₹6,000 प्रदान करता है।",
    "eligibility": "योजना दिशानिर्देशों के अनुसार पात्र भूमिधारक किसान परिवार।",
    "advice": "पीएम-किसान पोर्टल पर eKYC और बैंक खाते का विवरण अद्यतन रखें।"
  },
  {
    "name": "किसान क्रेडिट कार्ड (KCC) योजना",
    "keywords": ["केसीसी", "KCC", "किसान क्रेडिट कार्ड", "कृषि लोन सस्ता"],
    "category": "All India Scheme",
    "focus": "सस्ती ऋण तक पहुंच",
    "details": "खेती, बीज, उर्वरक और अन्य कृषि गतिविधियों के लिए अल्पकालिक ऋण प्रदान करता है। केंद्रीय बजट 2025-26 में केसीसी के लिए संशोधित ब्याज सबवेंशन योजना (MISS) के तहत ऋण सीमा ₹3 लाख से ₹5 लाख तक बढ़ाने की घोषणा की गई। कुछ रिपोर्टों में इसे ₹7 लाख तक बढ़ाने की भी बात कही गई है।",
    "eligibility": "किसान, जिसमें किरायेदार, मौखिक पट्टेदार, बटाईदार शामिल हैं।",
    "advice": "रियायती ब्याज दरों पर इन ऋणों का लाभ उठाएं, शीघ्र पुनर्भुगतान के लिए अतिरिक्त प्रोत्साहन के साथ। विवरण के लिए स्थानीय बैंक शाखाओं से संपर्क करें।"
  },
  {
    "name": "एग्रीकल्चर इंफ्रास्ट्रक्चर फंड (AIF)",
    "keywords": ["एआईएफ", "AIF", "कृषि अवसंरचना कोष", "फसल कटाई उपरांत प्रबंधन"],
    "category": "All India Scheme",
    "focus": "फसल कटाई उपरांत प्रबंधन और सामुदायिक कृषि संपत्तियों के लिए वित्तपोषण",
    "details": "फसल कटाई उपरांत प्रबंधन बुनियादी ढांचे और सामुदायिक कृषि संपत्तियों में व्यवहार्य परियोजनाओं में निवेश के लिए मध्यम-दीर्घावधि ऋण वित्तपोषण सुविधा प्रदान करता है।",
    "eligibility": "किसान उत्पादक संगठन (FPOs), प्राथमिक कृषि ऋण समितियां (PACS), और उद्यमी।",
    "advice": "भंडारण, प्रसंस्करण इकाइयों आदि के निर्माण के लिए उपयोगी। बैंकों या ऑनलाइन पोर्टल के माध्यम से आवेदन करें।"
  },
  {
    "name": "प्रथम बार उद्यमियों के लिए नई योजना (महिला, एससी/एसटी)",
    "keywords": ["नया उद्यमी लोन महिला एससी एसटी", "पहली बार उद्यमी योजना"],
    "category": "All India Scheme (New - Budget 2025-26)",
    "focus": "नए उद्यमियों (महिला, एससी, एसटी) के लिए वित्तीय सहायता",
    "details": "5 लाख महिला, अनुसूचित जाति (एससी), और अनुसूचित जनजाति (एसटी) के प्रथम बार उद्यमियों का समर्थन करने के लिए एक नई योजना शुरू की जानी है। यह अगले पांच वर्षों में ₹2.00 करोड़ तक का सावधि ऋण प्रदान करेगी और इसमें ऑनलाइन क्षमता निर्माण शामिल होगा।",
    "eligibility": "महिला, एससी, एसटी श्रेणियों के प्रथम बार उद्यमी।",
    "advice": "इस योजना के आधिकारिक शुभारंभ और दिशानिर्देशों की प्रतीक्षा करें।"
  },
  {
    "name": "प्रधानमंत्री धन-धान्य कृषि योजना",
    "keywords": ["धन-धान्य कृषि योजना", "100 कृषि जिले", "कम उत्पादकता वाली खेती"],
    "category": "All India Scheme (New - Budget 2025)",
    "focus": "कम उत्पादकता और फसल गहनता वाले 100 कृषि-जिलों का विकास करना।",
    "details": "केंद्रीय बजट 2025 में घोषित छह नई कृषि योजनाओं में से एक, जो कम उत्पादकता और फसल गहनता वाले क्षेत्रों पर ध्यान केंद्रित करते हुए 100 कृषि-जिलों का विकास करेगी।",
    "eligibility": "योजना के लागू होने पर परिभाषित किया जाएगा।",
    "advice": "कार्यान्वयन के अनुसार योजनाओं की घोषणा और विशिष्ट प्रावधानों की निगरानी करें।"
  },
  
  {
    "name": "एमएसएमई लोन योजनाएं (PMMY, PMEGP, CGTMSE)",
    "keywords": ["एमएसएमई लोन", "मुद्रा योजना", "PMEGP लोन", "CGTMSE स्कीम"],
    "category": "All India Scheme",
    "focus": "सूक्ष्म, लघु और मध्यम उद्यमों के लिए वित्तीय सहायता",
    "details": "इसमें प्रधानमंत्री मुद्रा योजना (PMMY) शामिल है, जिसमें 'तरुण प्लस' श्रेणी के तहत ₹20 लाख तक का ऋण, प्रधानमंत्री रोजगार सृजन कार्यक्रम (PMEGP), और सूक्ष्म एवं लघु उद्यमों के लिए क्रेडिट गारंटी ट्रस्ट फंड (CGTMSE) शामिल हैं। सिडबी भी विभिन्न ऋण प्रदान करता है।",
    "eligibility": "व्यक्ति और एमएसएमई, जिसमें कृषि-संबद्ध क्षेत्र शामिल हैं।",
    "advice": "जनसमर्थ पोर्टल या बैंक शाखाओं के माध्यम से जानकारी प्राप्त करें।"
  },
  {
    "name": "जन समर्थ पोर्टल",
    "keywords": ["जन समर्थ पोर्टल", "सरकारी लोन पोर्टल ऑनलाइन", "सब्सिडी स्कीम पोर्टल"],
    "category": "Digital Platform",
    "focus": "सरकारी ऋण योजनाओं के लिए वन-स्टॉप डिजिटल प्लेटफॉर्म",
    "details": "यह पोर्टल विभिन्न सरकारी प्रायोजित ऋण और सब्सिडी योजनाओं को जोड़ता है, जिससे आवेदन और अनुमोदन प्रक्रिया सरल हो जाती है।",
    "eligibility": "लिंक्ड योजनाओं के तहत ऋण चाहने वाले व्यक्ति।",
    "advice": "अपनी आवश्यकताओं के अनुसार प्रासंगिक योजनाओं के लिए पात्रता और आवेदन प्रक्रियाओं के लिए इस पोर्टल को देखें।"
  }
]